In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("total_stars.csv")
df.head()

,Unnamed: 0,Name,Distance,Mass,Radius,Unnamed: 5,Star_name,Distance.1,Mass.1,Radius.1
0,0,Sun,0.000015813,1,1,0,SDSS J000013.54+255418.6 [de],46.1,0.045820,0.101735
1,1,Sirius,0008.6,2.1,1.71,2,2MASS J00040288-6410358,192.0,0.018137,0.167504
2,2,Canopus,0310,15,71,4,2MASS J00242463-0158201,37.7,0.075412,0.112012
3,3,Alpha Centauri,0004.4,1.1,1.2,6,2MASS J00274197+0503417,236.0,0.029592,0.147979
4,4,Arcturus,0037,1.1,26,8,2MASSW J0030300-145033,87.2,0.051548,0.100708

In [4]:
df.columns

Index(['Unnamed: 0', 'Name', 'Distance', 'Mass', 'Radius', 'Unnamed: 5',
       'Star_name', 'Distance.1', 'Mass.1', 'Radius.1'],
      dtype='object')

In [5]:
df.drop(['Unnamed: 0','Unnamed: 5'],axis=1,inplace=True)
df.columns

Index(['Name', 'Distance', 'Mass', 'Radius', 'Star_name', 'Distance.1',
       'Mass.1', 'Radius.1'],
      dtype='object')

In [6]:
df=df.dropna()
df.head()

,Name,Distance,Mass,Radius,Star_name,Distance.1,Mass.1,Radius.1
0,Sun,0.000015813,1,1,SDSS J000013.54+255418.6 [de],46.1,0.045820,0.101735
1,Sirius,0008.6,2.1,1.71,2MASS J00040288-6410358,192.0,0.018137,0.167504
2,Canopus,0310,15,71,2MASS J00242463-0158201,37.7,0.075412,0.112012
3,Alpha Centauri,0004.4,1.1,1.2,2MASS J00274197+0503417,236.0,0.029592,0.147979
4,Arcturus,0037,1.1,26,2MASSW J0030300-145033,87.2,0.051548,0.100708

In [7]:
del df["Distance.1"]
del df["Mass.1"]
del df["Radius.1"]
del df["Star_name"]

In [8]:
df.head()

             Name     Distance Mass Radius
0             Sun  0.000015813    1      1
1          Sirius       0008.6  2.1   1.71
2         Canopus         0310   15     71
3  Alpha Centauri       0004.4  1.1    1.2
4        Arcturus         0037  1.1     26

In [9]:
df.to_csv('cleaned_total_stars.csv')